Documents/НакладнаяНаДоставку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>НакладнаяНаДоставку</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пустой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачалаПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончанияПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОснование</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Comment>Уникальный идентификатор обработки обслуживания.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресторан</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Comment>Сотрудник организации</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НакладнаяНаДоставку/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьВидимость()
	
	// Командная панель.
	Элементы.ПодробныйРежим.Пометка = ПодробныйРежим;
	Элементы.РежимДокументовОснований.Пометка = РежимДокументовОснований;
	
	// Элементы.
	Элементы.ГруппаПериод.Видимость = (Не РежимВыбора) И ПодробныйРежим;
	Элементы.ДокументыОснования.Видимость = (Не РежимВыбора) И РежимДокументовОснований;
	Элементы.ДокументыОснованияГруппаПериод.Видимость = (Не РежимВыбора) И ПодробныйРежим;
	Элементы.ДокументыОснованияДокументОснованиеСуммаДокументаБезСкидок.Видимость = Элементы.ДокументыОснованияГруппаПериод.Видимость;
	Элементы.ДокументыОснованияДокументОснованиеСуммаНаценкиДокумента.Видимость = Элементы.ДокументыОснованияГруппаПериод.Видимость;
	Элементы.ДокументыОснованияДокументОснованиеСуммаСкидкиДокумента.Видимость = Элементы.ДокументыОснованияГруппаПериод.Видимость;
	Элементы.ДокументыОснованияДокументОснованиеОтветственный.Видимость = Элементы.ДокументыОснованияГруппаПериод.Видимость;
	Элементы.ДокументыОснованияДокументОснованиеКомментарий.Видимость = Элементы.ДокументыОснованияГруппаПериод.Видимость;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПодробныйРежим(Команда)
	
	ПодробныйРежим = Не ПодробныйРежим;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПодробныйРежим()

&НаКлиенте
Процедура РежимДокументовОснований(Команда)
	
	РежимДокументовОснований = Не РежимДокументовОснований;
	
	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // РежимДокументовОснований()

&НаКлиенте
Процедура ОткрытьДокументОснование(Команда)
	
	Если (Не Элементы.ДокументыОснования.ТекущиеДанные = Неопределено) Тогда
		Если ЗначениеЗаполнено(Элементы.ДокументыОснования.ТекущиеДанные.ДокументОснование) Тогда
			ОткрытьЗначение(Элементы.ДокументыОснования.ТекущиеДанные.ДокументОснование);
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры // ОткрытьДокументОснование()


&НаКлиенте
Процедура ДокументыОснованияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьДокументОснование(Неопределено);
	
КонецПроцедуры // ДокументыОснованияВыбор()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Режим выбора.
	РежимВыбора = __РаботаСДиалогамиКлиентСервер.ФормаРежимВыбора(ЭтаФорма, Элементы.Список,
		"ПодробныйРежим,РежимДокументовОснований, ГруппаПериод,СуммаДокументаБезСкидок,СуммаНаценкиДокумента,СуммаСкидкиДокумента,Ответственный,Комментарий, ДокументыОснования");
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// Настройка формы.
	УстановитьВидимость();
	
КонецПроцедуры // ПриОткрытии()
